for n in range(0, 14):  #максимально-возможное колличество месяцев можно вычислить делением кол-вом дней в году(365) на кол-во дней месяце(28)
    #перебираем полученное колличество месяцев
    for k in range(0, 13):  #максимальное кол-во месяцев вычисляется так же, как в предыдущем переборе, только меняем 28 на 30
    #перебираем полученное колличество месяцев        
        for m in range(0, 12):  #идентичный подход, как во втором переборе
        #перебираем полученное колличество месяцев              
             if 28 * n + 30 * k + 31 * m == 365:
            #проверяем условие
                print(f"n = {n}, k = {k}, m = {m}")
                #получаем решение
